# Drawing Conclusions Quiz
Use the space below to explore `store_data.csv` to answer the quiz questions below.

In [4]:
# Do your analysis and answer the following (type your answers !! do not throw the code in there and submit the file)

# Which store has the highest total sales for the final month of data? ---StoreA------
# Which store makes the most sales on average? ---StoreB--------
# Which store sells the most during the week of March 13th, 2016? ---StoreD------
# In what week does store C make its worst sales? ----2014-07-06------ 
# Which store has the most sales in the latest 3-month period? ----storeA-------
# What is the most consistent store in sales ? ----storeB--------- 
# Given the information you gathered, what do you think is the best store financially? -----storeB-------

In [5]:
# import and load the data
import pandas as pd
df = pd.read_csv('store_data.csv')

In [6]:
# explore the data (gather as much information as you can)
df.head()

         week  storeA  storeB  storeC  storeD  storeE
0  2014-05-04    2643    8257    3893    6231    1294
1  2014-05-11    6444    5736    5634    7092    2907
2  2014-05-18    9646    2552    4253    5447    4736
3  2014-05-25    5960   10740    8264    6063     949
4  2014-06-01    7412    7374    3208    3985    3023

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   week    200 non-null    object
 1   storeA  200 non-null    int64
 2   storeB  200 non-null    int64
 3   storeC  200 non-null    int64
 4   storeD  200 non-null    int64
 5   storeE  200 non-null    int64
dtypes: int64(5), object(1)
memory usage: 9.5+ KB

In [8]:
# clean the data
df.duplicated().sum()

0

In [12]:
# total sales for the last month
#df.tail(4)
df.iloc[:-196].sum()

week      2014-05-042014-05-112014-05-182014-05-25
storeA                                       24693
storeB                                       27285
storeC                                       22044
storeD                                       24833
storeE                                        9886
dtype: object

In [18]:
df.tail(4)

           week  storeA  storeB  storeC  storeD  storeE
196  2018-02-04    4853    6503    4187    5956    1458
197  2018-02-11    9202    3677    4540    6186     243
198  2018-02-18    3512    7511    4151    5596    3501
199  2018-02-25    7560    6904    3569    5045    2585

In [23]:
# average sales
df.mean()

C:\Users\olaso\AppData\Local\Temp\ipykernel_28696\1214937871.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

storeA    5865.480
storeB    6756.710
storeC    4942.105
storeD    5431.405
storeE    2580.025
dtype: float64

In [42]:
# sales on march 13, 2016
df.set_index('week')
df[df['week'] == '2016-03-13']

          week  storeA  storeB  storeC  storeD  storeE
97  2016-03-13    2054    1390    5112    5513    2536

In [20]:
# worst week for store C
minC = df['storeC'].min()
df.set_index('storeC')
df[df['storeC'] == minC]

         week  storeA  storeB  storeC  storeD  storeE
9  2014-07-06    8567    3228     927    3277     168

In [27]:
df.tail(14)

           week  storeA  storeB  storeC  storeD  storeE
186  2017-11-26    6866    5011    5401    4736    3232
187  2017-12-03    5179    3850    6121    6778     113
188  2017-12-10    9348    5624    5446    5448     227
189  2017-12-17    5310    8647    5680    7049    3578
190  2017-12-24    8976    9503    6240    3882    2890
191  2017-12-31   11875    1527    6711    5265    1701
192  2018-01-07    8978   11312    4158    5019    3842
193  2018-01-14    6963    4014    4215    7153    3097
194  2018-01-21    5553    3971    3761    6255    3071
195  2018-01-28     282    6351    7759    5558    1028
196  2018-02-04    4853    6503    4187    5956    1458
197  2018-02-11    9202    3677    4540    6186     243
198  2018-02-18    3512    7511    4151    5596    3501
199  2018-02-25    7560    6904    3569    5045    2585

In [26]:
# total sales during most recent 3 month period
df.iloc[187:].sum()

week      2017-12-032017-12-102017-12-172017-12-242017-1...
storeA                                                87591
storeB                                                79394
storeC                                                66538
storeD                                                75190
storeE                                                27334
dtype: object

In [31]:
df.iloc[196:].sum()

week      2018-02-042018-02-112018-02-182018-02-25
storeA                                       25127
storeB                                       24595
storeC                                       16447
storeD                                       22783
storeE                                        7787
dtype: object

In [32]:
df.sum()

week      2014-05-042014-05-112014-05-182014-05-252014-0...
storeA                                              1173096
storeB                                              1351342
storeC                                               988421
storeD                                              1086281
storeE                                               516005
dtype: object

In [36]:
# Go back to the top and answer the questions